# LowestAssociatedLevelAboveHighestAssociatedLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..LowestAssociatedLevelAboveHighestAssociatedLevel Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
The Lowest Associated Level is set above the Highest Associated Level
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LowestAssociatedLevelAboveHighestAssociatedLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LowestAssociatedLevelAboveHighestAssociatedLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LowestAssociatedLevelAboveHighestAssociatedLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace